{
	"ConnectionSettings": {
		//The URLs the server will listen to. Multiple URLs can be specified. HTTP:// is prefixed where needed.
		//Examples: localhost, http://example.com, https://contoso.com
		"ServerAddresses": [
            "localhost:80"
		],
		//Allow external domains to communicate with this server. This is primarily useful when a system's front-end is running on a different webserver.
		//Only the addresses specified in the ServerAddresses are allowed by default. Use an asterisk (*) to allow all domains. HTTP:// is prefixed where needed.
		"AccessControl": [
            "localhost:3000"
		],
		//Whether the server should automatically detect its address. This address will be used in addition to the ones specified in ServerAddresses.
		"AutoDetectAddress": true,
		//The port that the server should run on. Only used if AutoDetectAddress is true.
		"AutoDetectPort": 80
	},
	"PerformanceSettings": {
		//The amount of worker threads the server should use. More threads allows the server to handle more requests at once, but increases server load.
		//Using more threads than this computer has logical processors can result in degraded performance.
		//Recommended setting is the logical processor count minus 3.
		"WorkerThreadCount": 5
	},
	"WebserverSettings": {
		//The folder that contains the web pages and related files. All HTML, JS, CSS, etc files must be inside this folder (or its subfolders) to be accessible.
		"wwwroot": "wwwroot",
		//The folder that contains the error pages and related files.
		//The HTML files for each page must use the error's status code as name (eg. "404.html")
		//If an error page isn't found, a simple built-in page will be used.
		//If this folder is placed outside of wwwroot, the pages can't be accessed using an URL. They will only appear if an error is triggered.
		"errorpages": "wwwroot/errors"
	},
	"AuthenticationSettings": {
		//The time in seconds until a session becomes invalid if left alone for too long while the "Keep me signed in" checkbox was enabled during login.
		//Default is 604800, equal to 7 days.
		"SessionTimeoutLong": 604800,
		//The time in seconds until a session becomes invalid if left alone for too long.
		//Default is 7200, equal to 2 hours.
		"SessionTimeoutShort": 7200,
		//The regex that all user passwords should comply to.
		"PasswordRegex": "[A-z0-9]{10,}",

		//###########################################################################
		//# WARNING: All of the below settings MUST be kept confidential!			#
		//###########################################################################
		//The password for the built-in Administrator account.
		"AdministratorPassword": "W@chtw00rd"
	},
	"BackupSettings": {
		//The time between each automatic backup. Backups can always be manually triggered through the /backup endpoint if necessary.
		//Do NOT place this folder within either wwwroot or errorpages. Doing so will allow users to download the backup files without requiring administrator privileges, exposing your database to the public.
		//To restore a backup, extract the ZIP file and move its contents to the server's folder.
		//Default is 86400, equal to 1 day. Set to 0 to disable.
		"BackupInterval": 86400,
		//The folder to write the backup files to.
		"BackupFolder": "Backups"
	}
}
